// Програма Добуток матриць
#include <iostream>
using namespace std ;
#define N 1
#define M 2
#define P 3
int main(void)
// починаємо програму
{
int i, j, k;
int A[N][M] = { 1, 1};
int B[M][P] = { 2, 3, 2,
2, 2, 2};
// вводимо в гру матриці!
int C[N][P];
// оголошуємо матрицю-мутант двох попередніх? 
// три рядки, 6 стовпців
cout << "Матриця С: \n";
for (i = 0; i < N; i++)
{
for (j = 0; j < P; j++)
{
*(*(C + i) + j) = 0;
//
for (k = 0; k < M; k++)
*(*(C + i) + j) += *(*(A + i) + k) *
*(*(B + k) + j);
//
cout << *(*(C + i) + j) << "\t";
}
// в результаті все буде вісім. чому вісім?
cout << "\n" << "\n";
}
}